# Задан список слов, в которых встречается символ ‘_’ подчеркивание.
# Создать новый список, в котором символ подчеркивания в словах ‘_’ заменить символом ‘ ‘ (пробел).
# l = [ "ab_cd_e", "abc", "a_b_c", "a__bc_d_", "__" ]

l = ["ab_cd_e", "abc", "a_b_c", "a__bc_d_", "__"]
l_2 = ",".join(l)
b = (l_2.replace("_", " ")).split(",")
print(f'Новы список после замены символа "_" на символ " " {b}')

