# Создайте пустую переменную. Проверьте её на истинность и ложность. Объясните полученный результат.

a = input()
if a:
    print(True)
else:
    print(False)

# Пустое значение переменной всегда False, в решении условие если "а" (т.е. если true) то вывести в консоль True.
# Иначе вывести False.
# Результат работы программы Fasle т.к. а = не содержит ничего, а следовательно имеет значение false.
# Для проверки можно ввести с клавиатуры любой символ и результатом работы программы будет True.
