# Используя стандартные арифметические операции представьте самое большое число из
# цифр 4, 4, 4 и приведите его значение.

list_of_4 = [4, 4, 4]

# result = list_of_4[0] ** list_of_4[1] ** list_of_4[2]
# print('Самое большое число получиться путём возведения в степень 4**4**4: ', f'{result}', sep='\n')

# Т.к. я не очень понял задание ниже другое решение с использованием только заданных цифр.
# result = str(list_of_4[0]) * int(list_of_4[1]) * int(list_of_4[2])
# print(f'Самое большое число из цифр 4 4 4 = {int(result)}')
