# Домашнее задание 3
# Тема: Строки
# Срок до 16 июня. Отправить чтобы я успел проверить до занятия.
# Учитывая мои рекомендации, выполняем домашнюю работу.
# 1. Дана строка.
# Сначала выведите третий символ этой строки.
# Во второй строке выведите предпоследний символ этой строки.
# В третьей строке выведите первые пять символов этой строки.
# В четвертой строке выведите всю строку, кроме последних двух символов.
# В пятой строке выведите все символы с четными индексами (считая, что индексация начинается с 0, поэтому символы выводятся начиная с первого).
# В шестой строке выведите все символы с нечетными индексами, то есть начиная со второго символа строки.
# В седьмой строке выведите все символы в обратном порядке.
# В восьмой строке выведите все символы строки через один в обратном порядке, начиная с последнего.
# В девятой строке выведите длину данной строки.
# 2. Разделить строку “Apples, Oranges, Pears, Bananas, Berries” по запятым и вывести на экран. Затем объединить элементы с использованием пробела, чтобы программа вывела “Apples Oranges Pears Bananas Berries”.
# 3. Ввести предложение. Если число символов в предложении кратно 3 - добавить ! к концу строки. Вывести строку на экран.
# 4*. Замените “#” на “/” в 'www.my_site.com#about '. (задание на погуглить)